/* Задача 8: Напишите программу, которая на вход принимает число (N), а на выходе показывает все чётные числа от 1 до N.
5 -> 2, 4
8 -> 2, 4, 6, 8*/

int userNumberA = new int();
Console.WriteLine("Введи первое число");
userNumberA = Convert.ToInt32(Console.ReadLine());
int i = 0;
while (i < userNumberA);
{ 
i +=2; 
Console.WriteLine(i);    
}

Console.WriteLine("no");